''''19. Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.'''

import numpy as np
import random
b=[]
a=[random.randint(200,300) for i in range(20)]
k=0
print(a)
for g in b:
    if g%2==3:
        b.append(g)
        k+=1
if k==0:
    print('Елементів що задовільняють умову не виявлено')
    exit(0)
a_new=np.array(b)
print(f'Елементи, що задовільняють умову:{a_new}')
print(f'Сума:{a_new.sum()}')