'''27. Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.'''
import numpy as np
import random
a=[50,60,70,20,25,27,36,43,65,45,88,76]
b='Січень Лютий Березень Квітень Травень Червень Липень Серпень Вересень Жовтень Листопад Грудень'.split()
print(list(zip(a,b)))
c=np.array(a)
print(f'Загальна кількість опадів протягом року:{c.sum()}')
print(f'Середня кількість опадів:{c.mean()}')
print(f'Найпосушливіший місяць:{b[a.index(c.min())]}')
k=0
for g in a:
    if g<30:
        k+=1
print(f'Посушлвивих місяців:{k}')