'''38. Дані про направлення вітру (північний, південний, східний, західний) і
силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
південний вітер з силою, що перевищує 8 м / с.'''

import numpy as np
import random

n=[1,2,3,4,5,6,7,8,9,10]
a='південний південний південний західний західний південний східний північний північний східний'.split()
b='сила'.split()*12
c=[random.randint(5,15) for i in range(11)]
#задопомогою функції zip об'єднуємо списки в кортежі значень для кожного дня декади
#створюємо масив з кортежів для зручного подання даних
l=np.array(list(zip(n,a,b,c)))
print(l)
k=0#лічильник виконання умови
t=-1#зміна індексу елементів списку (а) після видалення del
for i in a:
     if i == 'південний':
      t+=1
      t+= a.index(i)
      del a[t]
      if c[t]>8:
        k+=1
if k==0:
 print('Жодного разу')
 exit(0)
print(f'Південний вітер більше 8 м/с: {k} раз')

