'''39. Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.'''

import numpy as np
import random
n=[1,2,3,4,5,6,7,8,9,10]
t=b='температура:'.split()*10 #список із 12 слів
c=[random.randint(-5,15) for i in range(11)]
v='опади(мм):'.split()*10
w=[random.randint(1,15) for i in range(11)]
b=[]#список визначення погоди(дощ чи сніг)
d=[]#список опадів дощової погоди
f=[]#список опадів снігової погоди
k=0#перехід до наступного елементу зі списку (w) опадів
for i in c:
    if i>=0:
        b.append('дощ')
        d.append(w[k])
        k+=1
    else:
        b.append('сніг')
        f.append(w[k])
        k+=1
d=np.array(d)
f=np.array(f)
v=np.array(list(zip(n,t,c,b,v,w))) #створення масиву із списку zip-об'єднань попередніх списків
print(v)
print('Опади у вигляді дощу:',d)
print(f'Кількість: {d.sum()} ')
print('Опади у вигляді снігу:',f)
print(f'Кількість: {f.sum()} ')
