'''45. Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.'''

b=[]#список з висотою
h=int(input('H='))
k=0
x=0
if h%5!=0:
    print('Помилка')
    exit(0)
else:
  while h>5:
       x=h-5
       h=x
       b.append(x)
b=list(reversed(b))#у зворотньому порядку, ажде ми додаємо елементи з кінця
for i in range(1,len(b)+1):
 s=b.pop(0)#pop(0),оскільки даний метод щоразу змінює список, видаояючи перший елемент
 print(f'{i} опора, довжина={s} ')


