'''50. У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів
виграшних квитків. Перевірте, чи є квиток з номером N виграшним.'''

import numpy as np
import random
a=[]#номери виграшних квитків
b='Виграшний_квток_№'.split()*10
count=0#лічильник цифр що задовільняють умову додадвання до списку а(ідентичність)
while count<10:#всього виграшних квитків 10
    numbers = random.randrange(1, 100)

    if numbers not in a:#якщо рандомне число ще не міститься в (а)-додаємо його
        a.append(numbers)
        count += 1
    else:#інакше пропускаємо
        pass

a.sort()#сортуємо список рандомних значень за зростанням
v=np.array(list(zip(b,a)))#виведення таблиці виграшних квитків
n=int(input('N='))
if n in a:#чи є номер нашого квитка серед виграшних
     print('True')
else:
    print('False')
print(v)