'''51. Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.'''

k=0#лічильник цифр що задовільняють умову
a=[11,12,13,14,15,16,17]
for i in range(len(a)):#прохід по всі елементах масиву
    if a[i]-i>10:#перевірка умови
        k+=1
if k==len(a):#всі елементи пройшли умову
    print('True')
else:#в іншому випадку
    print('False')