'''55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.'''

import numpy as np
import random
x=[]
n=[]
for i in range(1,31):#заповнення списку номерів квартир від 1 до 30
     n.append(i)
t='квартира:'.split()*30
l='має'.split()*30
c=[random.randint(1,10) for i in range(30)]#мешканців кварттири рандомно від 1 до 10
e='мешканців'.split()*30
v=np.array(list(zip(t,n,l,c,e)))
print(v)
print('Після переїзду')
c.reverse()#зворотній порядок значень мешканців
d=0#лічильник квартир
for i in range(len(n)):#проміжок індекксів
    if c[i]>5:#якщо кіькість мешканців по індексу (і) більше 5-ти, то додаємо номер квартири по цьоиу ж індексу
     x.append(n[i])
     d+=1
k=np.array(list(zip(t,n,l,c,e)))
print(k)
print(f'Квартири в яких проживає більше 5 мешканців: {x}')
print('Кількість:',d)


