'''60. Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
однакових чисел, що йдуть підряд в ньому.'''
x=[]#список повторюваних чисел
a=[1,2,2,2,2,3,4,5,5,0]
print('Мавсив:',a)
#проходимо по індексам масиву
for i in range(len(a)):
#Коли дійшли до останнього, то якщо він ріний передостанньому додаємо його в (x) і виходимо з for.
 if i==len(a)-1:
  if a[i]==a[i-1]:
    x.append(a[i])
    break
  else:
      break
#А взагалі, додаємо елменти a[i] в (х) якщо вони рівна a[i+1]
 if a[i]==a[i+1]:
     x.append(a[i])
#Якщо індекс елемента не останній, тобто це те число на якому закінчується повторюванісь. Додаємо і його .
 if i!=len(a)-1 and a[i]!=a[i+1] and a[i]==a[i-1]:
     x.append(a[i])
     continue
print('Повтрювані послідовності:',x)
#За допомогою множини, виявлямо які ж саме числа повторюються
set=list(set(x))
print('Тобто числа:',set)
#Створюємо список (d) в який додаємо кількісну характеристику повтрень
#А потім по відповідним індексам виводимо результати
d=[]
for index in range(len(set)):
    d.append(x.count(set[index]))
    print(f'{set[index]} - повторюється {x.count(set[index])} раз(и)')
print(f'Найбільше повторень має число: {set[d.index(max(d))]}, а саме:{max(d)} ')




