'''9. З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.'''
import numpy as np
temperature=[]
a=0
t=int(input('Температура='))
t+=1
while a<13:
    t-=1
    temperature.append(t)#додавання зміни температури
    a+=1
b=np.array(temperature)#створення масиву зі списку
print(f'Зміна t з 8 до 20 години:\n{b}')
for i in range(len(b)):
    if b[i]<0 :
     print(f'Мінусова температура о {8 + i} годині')
     break
else:
     print('Температура була плюсовою')